{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[SOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[SOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "special_tokens": {
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          2
        ],
        "tokens": [
          "[EOS]"
        ]
      },
      "[SOS]": {
        "id": "[SOS]",
        "ids": [
          1
        ],
        "tokens": [
          "[SOS]"
        ]
      }
    }
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[PAD]": 0,
      "[SOS]": 1,
      "[EOS]": 2,
      "[MASK]": 3,
      "[UNK]": 4,
      "H": 5,
      "N": 6,
      "a": 7,
      "b": 8,
      "c": 9,
      "d": 10,
      "e": 11,
      "f": 12,
      "g": 13,
      "h": 14,
      "i": 15,
      "k": 16,
      "l": 17,
      "m": 18,
      "n": 19,
      "o": 20,
      "p": 21,
      "r": 22,
      "s": 23,
      "t": 24,
      "u": 25,
      "v": 26,
      "x": 27,
      "y": 28,
      "z": 29,
      "Ċ": 30,
      "Ġ": 31,
      "ar": 32,
      "en": 33,
      "te": 34,
      "us": 35,
      "az": 36,
      "do": 37,
      "ardo": 38,
      "azardo": 39,
      "azardous": 40,
      "Ġs": 41,
      "he": 42,
      "Ġt": 43,
      "Ġe": 44,
      "in": 45,
      "de": 46,
      "Ġthe": 47,
      "No": 48,
      "cen": 49,
      "cte": 50,
      "hazardous": 51,
      "ven": 52,
      "Ġin": 53,
      "Ġde": 54,
      "Ġhazardous": 55,
      "tecte": 56,
      "Ġscen": 57,
      "Ġeven": 58,
      "Ġdetecte": 59,
      "Ġscene": 60,
      "Ġevent": 61,
      "Ġdetected": 62,
      "Hazardous": 63,
      "Ġb": 64,
      "Ġby": 65,
      "Ġc": 66,
      "an": 67,
      "Ġst": 68,
      "Ġcar": 69,
      "Ġl": 70,
      "Ġa": 71,
      "on": 72,
      "Ġon": 73,
      "gh": 74,
      "igh": 75,
      "ight": 76,
      "ad": 77,
      "aight": 78,
      "raight": 79,
      "head": 80,
      "Ġstraight": 81,
      "Ġahead": 82,
      "Ġm": 83,
      "ef": 84,
      "Ġlef": 85,
      "Ġleft": 86,
      "eu": 87,
      "oeu": 88,
      "re": 89,
      "rn": 90,
      "urn": 91,
      "vre": 92,
      "Ġturn": 93,
      "anoeu": 94,
      "Ġmanoeu": 95,
      "Ġmanoeuvre": 96,
      "ane": 97,
      "Ġlane": 98,
      "op": 99,
      "art": 100,
      "Ġstop": 101,
      "Ġstart": 102,
      "ge": 103,
      "han": 104,
      "Ġchan": 105,
      "Ġchange": 106,
      "or": 107,
      "tor": 108,
      "ro": 109,
      "it": 110,
      "xit": 111,
      "Ġexit": 112,
      "ac": 113,
      "co": 114,
      "min": 115,
      "pp": 116,
      "Ġapp": 117,
      "Ġonco": 118,
      "roac": 119,
      "ming": 120,
      "Ġapproac": 121,
      "Ġoncoming": 122,
      "Ġapproach": 123,
      "right": 124,
      "Ġright": 125,
      "ck": 126,
      "ru": 127,
      "Ġtru": 128,
      "Ġtruck": 129,
      "cl": 130,
      "cy": 131,
      "cle": 132,
      "cycle": 133,
      "otor": 134,
      "Ġmotor": 135,
      "Ġmotorcycle": 136,
      "ctor": 137,
      "Ġactor": 138,
      "Ġactors": 139,
      "ede": 140,
      "ian": 141,
      "pede": 142,
      "rian": 143,
      "st": 144,
      "Ġro": 145,
      "Ġpede": 146,
      "strian": 147,
      "Ġroad": 148,
      "Ġpedestrian": 149,
      "Ġbus": 150,
      "icycle": 151,
      "Ġbicycle": 152
    },
    "merges": [
      "a r",
      "e n",
      "t e",
      "u s",
      "a z",
      "d o",
      "ar do",
      "az ardo",
      "azardo us",
      "Ġ s",
      "h e",
      "Ġ t",
      "Ġ e",
      "i n",
      "d e",
      "Ġt he",
      "N o",
      "c en",
      "c te",
      "h azardous",
      "v en",
      "Ġ in",
      "Ġ de",
      "Ġ hazardous",
      "te cte",
      "Ġs cen",
      "Ġe ven",
      "Ġde tecte",
      "Ġscen e",
      "Ġeven t",
      "Ġdetecte d",
      "H azardous",
      "Ġ b",
      "Ġb y",
      "Ġ c",
      "a n",
      "Ġs t",
      "Ġc ar",
      "Ġ l",
      "Ġ a",
      "o n",
      "Ġ on",
      "g h",
      "i gh",
      "igh t",
      "a d",
      "a ight",
      "r aight",
      "he ad",
      "Ġst raight",
      "Ġa head",
      "Ġ m",
      "e f",
      "Ġl ef",
      "Ġlef t",
      "e u",
      "o eu",
      "r e",
      "r n",
      "u rn",
      "v re",
      "Ġt urn",
      "an oeu",
      "Ġm anoeu",
      "Ġmanoeu vre",
      "an e",
      "Ġl ane",
      "o p",
      "ar t",
      "Ġst op",
      "Ġst art",
      "g e",
      "h an",
      "Ġc han",
      "Ġchan ge",
      "o r",
      "t or",
      "r o",
      "i t",
      "x it",
      "Ġe xit",
      "a c",
      "c o",
      "m in",
      "p p",
      "Ġa pp",
      "Ġon co",
      "ro ac",
      "min g",
      "Ġapp roac",
      "Ġonco ming",
      "Ġapproac h",
      "r ight",
      "Ġ right",
      "c k",
      "r u",
      "Ġt ru",
      "Ġtru ck",
      "c l",
      "c y",
      "cl e",
      "cy cle",
      "o tor",
      "Ġm otor",
      "Ġmotor cycle",
      "c tor",
      "Ġa ctor",
      "Ġactor s",
      "e de",
      "i an",
      "p ede",
      "r ian",
      "s t",
      "Ġ ro",
      "Ġ pede",
      "st rian",
      "Ġro ad",
      "Ġpede strian",
      "Ġb us",
      "i cycle",
      "Ġb icycle"
    ]
  }
}